
//Напишите программу, которая на вход принимает 
//число и выдаёт его квадрат (число умноженное на само себя).

// 3 -> 3*3 = 9

int number = Convert.ToInt32(Console.ReadLine());

int SquareNumber = number * number;

Console.WriteLine("Квадрат числа равен " + SquareNumber);